{
	"email": [
		"hpoloner@gmail.com"
	],
	"phone": [
		"9174286286"
	],
	"name": "HARRY D. POLONER",
	"sections": {
"introduction":"",
		"education": [{
				"course": "BACHELOR OF ARTS , HISTORY , POLITICAL SCIENCE , JEWISH STUDIES",
				"start-date": "",
				"score": "",
				"end-date": "",
				"location": "New York, NY",
				"institution-name ": "Hunter College",
				"score-metric": ""
			},
			{
				"course": "MASTER OF ARTS , LIBERAL STUDIES",
				"start-date": "",
				"score": "",
				"end-date": "",
				"location": "New York, NY",
				"institution-name ": "New York University",
				"score-metric": ""
			}
		],
		"awards": [],
		"misc": [],
		"work-experience": [{
				"start-date": " 2014",
				"company-name": "ON RAMP DIGITAL",
				"end-date": "PRESENT",
				"designation": "FOUNDER /CEO",
				"job-description": "VIDEO LICENSING PLATFORM CONNECTING VIDEO CREATORS WITH THE WORLDS LARGEST CATALOG OF PRE - CLEARED COPYRIGHTS ALLOWING\nG REATER CREATIVITY AND INCREASED YOUTUBE REVENUE .\nCreated a platform for video creators to access the largest catalog of pre-cleared songs in the world by negotiating\nblanket license with every major music publishers (and larger independent). The OnRamp platform allow video creators\nto choose from over 4 million songs and using our platform we optimize creator content while protecting all rights\nowners. OnRamp will monetize video content while digitally distributing audio files to all the streaming services (and\niTunes). We facilitate targeted brand advertising campaigns around individual songs as well as individual artists. We\nwork directly with and add value to Multi-Channel Networks, Music Publishers, Record Companies and YouTube."
			},
			{
				"start-date": " 2012",
				"company-name": "MAKER STUDIOS",
				"end-date": 2013,
				"designation": "GENERAL MANAGER /MUSIC",
				"job-description": "A CUTTING - EDGE MEDIA COMPANY THAT BRIDGES THE GAP BETWEEN Y OU T UBE AND TV.\nBuilt and enhanced the administrative infrastructure for the largest digital media segment of the company which\nintegrated both vertically and horizontally across the network. Developed protocol to prevent infringement and to\nprotect owned intellectual property allowing partner channels to create and grow exponentially in a start-up\nenvironment. Ensured the proper registration of copyrights, digital distribution to retail, streaming services and third\nparty synchronization licenses. Negotiated with music production libraries to provide 5000 channels with low cost high\nquality production music. Negotiated all large deals with high profile talent, targeting strategic partnerships and\nonboarding channels into the network. Negotiated with the major music publishers to secure licenses for their catalogs\nto maximize revenue and to avoid infringement. Collaborated with talent to maximize production efficiencies and\nmarketing strategies while increasing revenue through co-writes, covers, giveaways and other initiatives. Oversaw\nchannel producers, creating an integrated social media strategy to increase the subscriber base, viewership and develop\ntheir brand.\n• Contributed to the 3,000% increase in channel content, increasing from 150 to more than 5,000 channels.\n• Contributed to the 4,000% increase in monthly views, increasing from 300 million to 1.6 billion.\n• Instrumental in making Maker Studios the #1 Independent Network on YouTube, according to comScore,\nby building the infrastructure enabling exponential growth."
			},
			{
				"start-date": "2009",
				"company-name": "SONGS MUSIC PUBLISHING",
				"end-date": 2011,
				"designation": "PARTNER , GENERAL MANAGER",
				"job-description": "A SERVICE - ORIENTED , INDEPENDENT MUSIC PUBLISHER .\nInstrumental in growing the business by identifying copyright catalogs that complemented the strategic direction of the\nstart-up. Coached and mentored 14 staff members in negotiating terms for acquisition of small deals and was hands-on in negotiating large deals. Orchestrated the integration, implementation and launch of integrated marketing programs\nto promote the newly acquired copyrights.\n• More than doubled the size of the total business by identifying and negotiating catalog acquisitions valued at\nmore than $20 million.\n• Evaluated more than 50 potential catalog acquisitions, ranging in value from $1M to $40M.\n• Spearheaded the strategic initiative to evolve the global royalty administration strategy, shifting it from\nthird-party administrators to direct Sub Publishing administration in an effort to streamline revenue globally."
			},
			{
				"start-date": " 2007",
				"company-name": "RESERVOIR MEDIA MANAGEMENT",
				"end-date": 2009,
				"designation": "SENIOR VICE PRESIDENT , CREATIVE",
				"job-description": "A BOUTIQUE MUSIC PUBLISHER BOASTING A MULTI - GENRE , HIT - DRIVEN CATALOG .\nEmployee #2, created administrative infrastructure for this start-up, focusing initially on the competitive Country Music\nmarket. Created company systems to handle administration, licensing and royalty collection. Developed and negotiated\noutsourcing/sub-publishing partnerships with international affiliates.\nProvided directions with outsourced\nSynchronization and Advertising resources to market, promote and place songs, capitalizing on newly created revenue.\n• Grew the copyright library from $0 to $20 million in less than two years by creating new revenue\nopportunities for music properties including securing hard-to-get placement in film and TV.\n• Secured lucrative copyrights with multiple hit songs and gold/platinum records and numerous ASCAP and BMI\nawards."
			},
			{
				"start-date": "2003",
				"company-name": "ASCAP",
				"end-date": 2007,
				"designation": "VICE PRESIDENT , MEMBERSHIP GROUP",
				"job-description": "A MEMBERSHIP ASSOCIATION OF MORE THAN 435,000 U.S. COMPOSERS , SONGWRITERS , LYRICISTS , AND MUSIC PUBLISHERS OF EVERY KIND OF MUSIC .\nSpearheaded the membership operation representing tens of thousands of songwriters. Coached a team to plan and\nproduce national outreach programs to generate positive publicity and educate the local music industry and songwriting\ncommunity. Partnered with major and independent record labels, and local and national publications in marketing\ninitiatives. Produced 35 entertainment and educational events per year and secured corporate sponsors in order to\npromote new artists.\n• Grew membership 15% annually by transitioning to an online registration process and guiding the staff to recruit,\nsign and service clients.\n• Created the Tribeca/ASCAP Music Lounge, an annual music event at the Tribeca Film Festival by negotiating\nterms with sponsor and organizing artist participation\n• Improved morale, effective communications and employee engagement by turning around a dysfunctional\nculture, identifying sources of negative communications and redirecting or eliminating instigators."
			},
			{
				"start-date": " 1995",
				"company-name": "EMI MUSIC PUBLISHING",
				"end-date": 2003,
				"designation": "REPRESENTS THE WORLD ' S MOST COMPREHENSIVE CATALOGUE OF CONTEMPORARY MUSIC WITH OVER 1.3 MILLION SONGS .",
				"job-description": "VICE PRESIDENT , TALENT ACQUISITION AND MARKETING"
			}
		],
		"introduction": "62 ND STREET,175 E, NEW YORK,0065 ",
		"extra-curricular": "\n     ICELAND\n   AIRWAVES,\n  Co-founder\n  WATERFALL \n FOUNDATION,\n       Board\n          of\n   Directors\n      ISRAEL\n         AND\n        CO.,\n       Board\n          of\n   Directors\n     REBOOT,\n      Member",
		"projects": [],
		"achievements": [],
		"skills": [
			"Advertising",
			"Analytic",
			"BMI",
			"Board of Directors",
			"Brand Development",
			"Business Development",
			"Channel",
			"Client Relations",
			"Contribute",
			"Country Music",
			"Create",
			"Data Integration",
			"Develope",
			"Digital Media",
			"EMI",
			"Film",
			"Independent",
			"Instrumental",
			"Intellectual",
			"Media Strategy",
			"Music",
			"Negotiations",
			"P&L Management",
			"Partnerships",
			"Produce",
			"Property",
			"Provide",
			"Publisher",
			"Publishing",
			"Record",
			"Storytelling",
			"Strategic Planning",
			"Studio",
			"Synchronization",
			"Team Building",
			"YouTube"
		]


	}
}
