{
  "phone": [
    "254547632"
  ],
  "sections": {
    "achievements": "",
    "skills": [
      "Python",
      "Ruby",
      "PHP",
      "SQL",
      "Javascript",
      "HTML5",
      "CSS",
      "DevOps",
      "ActiveMQ",
      "AJAX",
      "Ansible",
      "Apache",
      "Bash",
      "Capistrano",
      "Debian",
      "Git",
      "Google App Engine",
      "Jenkins",
      "jQuery",
      "JSON",
      "Lighttpd",
      "Linux(grep, ssh, tmux)",
      "MediaWiki",
      "Memcache",
      "Mercurial",
      "MySQL",
      "PostgreSQL",
      "Rails",
      "Ubuntu",
      "Unit Testing",
      "VirtualEnv"
    ],
    "education": [
      {
        "institution-name": "University of California",
        "location": "Irvine California",
        "course": "M.F.A. in Creative Writing",
        "start-date": "",
        "end-date": "2003"
      },
      {
        "institution-name": "University of California",
        "location": "San Diego",
        "course": "M.A. in English Literature",
        "start-date": "",
        "end-date": "2000"
      },
      {
        "institution-name": "Santa Ana College",
        "location": "Santa Ana,California",
        "course": "Computer Science",
        "start-date": "",
        "end-date": ""
      }
    ],
    "work-experience": [
      {
        "company-name": "First American Corporation",
        "start-date": "Sept'12",
        "end-date": "present",
        "job-description": "As senior developer, led design and implementation of enterprise infrastructure responsiblefor processing over $1 billion daily in financial transactions.Split duties evenly between backend and frontend development, overseeing redesigns of company’s two major public-facing websites: the CMS-backed official website and the Banking division’s mission critical online banking application. Spearheaded transition to more modern development environment adopting tools like distributed version control, static analysis, and continuous integration to ease development and improve productivity.",
        "designation": "Senior Applications Developer"
      },
      {
        "company-name": "First American Corporation",
        "start-date": "Oct '07",
        "end-date": "Sept'12",
        "job-description": "As developer, implemented and supported applications critical to the business operations of both the Wealth Management and Banking units.Within a diverse technical environment, carried critical projects forward to completion participating in all stages of development, from database and interface design to testing, quality assurance, and deployment.Promoted best practices and created resources, including wiki, that helped accelerate development process, clarify coding standards, and improve maintainability.",
        "designation": "Software Developer"
      },
      {
        "company-name": "Computer Specialists",
        "start-date": "Oct '04",
        "end-date": "Oct'07",
        "job-description": "Consulted for clients on website projects drawing up proposals, negotiating contracts, and authoring specs. Updated legacy scheduling and accounting system to optimize scheduling process and increase billable hours. Redeveloped company’s intranet site around PHP open source solutions and integrated it with existing management system to significantly improve office workflow.",
        "designation": "Web Developer"
      },
      {
        "company-name": "Klenwell Design",
        "start-date": "Sept '00",
        "end-date": "Oct'04",
        "job-description": "Contracted as designer and developer specializing in dynamic, standards-compliant websites for the LAMP platform. Implemented several popular open source frameworks, including Drupal, Joomla, Wordpress, and Mediawiki.",
        "designation": " Web Developer"
      }
    ],
    "awards": "",
    "extra-curricular": "",
    "projects": [
      
    ],
    "summary": "An experienced developer with a wide range of project experience, strong design sense, and a knack for problem-solving, I am looking for a permanent position as a senior developer or technical manager with a progressive company that appreciates the work of thoughtful professionals.",
    "introduction": "Tom Atwell tatwell@gmail.com http://www.linkedin.com/in/klenwell"
  },
  "name": "Tom Atwell",
  "email": [
    "tatwell@gmail.com@gmail.com"
  ]
}