{
  "phone": [
    "+17609121856"
  ],
  "sections": {
    "achievements": "",
    "skills": [
      "C/C++",
      "Qt",
      "Boost",
      "Objective-C",
      "Python",
      "numpy",
      "nltk",
      "wsgi",
      "Haxe & AS3",
      "OpenFL",
      "Flash",
      "MySQL",
      "Couchbase",
      "Concrete5",
      "Joomla",
      "Wordpress",
      "Jenkins",
      "Unit Testing",
      "SOASTA",
      "Chef",
      "Capistrano",
      "Macros",
      "Embedded",
      "VBScript",
      "Visual Studio",
      "XCode",
      "vim",
      "textmate",
      "sublime text",
      "Photoshop",
      "Krita",
      "Gimp",
      "Illustrator",
      "Flash",
      "Ableton Live",
      "Bitwig",
      "Reaper",
      "MPlayer",
      "MEncoder",
      "ffmpeg",
      "DSP",
      "Drums",
      "Analog Synthesizers",
      "Music Theory",
      "DSP",
      "automake",
      "cmake",
      "gcc",
      "git",
      "svn",
      "hg",
      "xml",
      "html(5)",
      "json",
      "DFA",
      "NFA",
      "bootstrap",
      "javascript",
      "jQuery",
      "Ruby",
      "Ruby on Rails",
      "Rack"
    ],
    "education": [
      {
        "institution-name": "University of Phoenix",
        "location": "",
        "course": "Bachelors of Science in Business Administration",
        "start-date": "",
        "end-date": "June 2007"
      },
      {
        "institution-name": "Victor Valley Junior College",
        "location": "Victorville, CA",
        "course": "Associate of Arts in Liberal Arts",
        "start-date": "",
        "end-date": "June 2005"
      }
    ],
    "work-experience": [
      {
        "company-name": "Music Mastermind Inc.",
        "start-date": "2010",
        "end-date": "Present",
        "job-description": "Worked on every aspect of the company’s two flagship products, from the cloud infrastructure to the client.   Worked on creating and designing the cloud-based audio, music and speech synthesis engine used by both products.   Created high-performance content-creation tools for use in-house.   Principal designer of new vocal synthesis engine’s cloud infrastructure and main contact with vocal synthesis experts in academia.   Transitioned entire company from svn to git, working on the new workflow with Jenkins and running a seminar on git.",
        "designation": "Senior Software Engineer"
      },
      {
        "company-name": "Van der Stahl Scientific Inc.",
        "start-date": "1998",
        "end-date": "2010",
        "job-description": "   Created and maintained the industry’s most comprehensive and attractive website, dealing with issues ranging from image quality of product shots to SEO.   Created high-performance cross-platform data logging software for use internally as well as by customers, that can connect both with Van der Stahl’s machinery as well as various third-party products.   Has been principal contact with main suppliers in Japan, going on numerous business trips and speaking to the contacts in both English and Japanese.   Performed countless machine calibrations and performed consultations for customers on calibration and validation issues.   Worked as salesperson and engineering consultant at our tradeshow booth for many years.   Played important rolls in the design of new products.",
        "designation": "Lab Systems Engineer/Calibration Consultant"
      },
      {
        "company-name": "Vertical Streaming Inc.",
        "start-date": "2008",
        "end-date": "2010",
        "job-description": "Wore many hats creating all new version of web application in Ruby on Rails with attractive video player in Flash/Actionscript 3. Transitioned codebase from svn to git and to using Ruby best practices. Made use of CDNs and otherwise performed many performance enhancements. Worked directly with customers and prospective customers to tailor our customizable system to their needs.",
        "designation": "Senior Software Engineer"
      },
      
    ],
    "awards": "",
    "extra-curricular": "",
    "projects": [
      
    ],
    "summary": "An experienced developer with a wide range of project experience, strong design sense, and a knack for problem-solving, I am looking for a permanent position as a senior developer or technical manager with a progressive company that appreciates the work of thoughtful professionals.",
    "introduction": "Thomas J. Webb Creative and insightful programmer. Sees the big picture to the minute detail and every important step in between. Can turn the vision in your head into reality and then some."
  },
  "name": "Thomas J. Webb",
  "email": [
    "thomas@thomaswebb.net"
  ]
}